#include "044E80.h"

#include "include_asm.h"
#include "macros_defines.h"
#include "main_functions.h"
#include "main_variables.h"

#include "hvqm2util.h"
#include "image.h"
#include "screen.h"
#include "sfxlimit.h"
#include "sound.h"
#include "story.h"
#include "the_game.h"
#include "update.h"

typedef struct struct_80192FB0_unk_0028 {
    /* 0x00 */ s32 unk_00;
    /* 0x04 */ s32 unk_04;
    /* 0x08 */ s32 unk_08;
    /* 0x0C */ s32 unk_0C;
    /* 0x10 */ s32 unk_10;
    /* 0x14 */ s32 unk_14;
    /* 0x18 */ s32 unk_18;
    /* 0x1C */ s32 unk_1C;
    /* 0x20 */ s32 unk_20;
    /* 0x24 */ s32 unk_24;
} struct_80192FB0_unk_0028; // size = 0x28

#define STRUCT_80192FB0_UNK_0028_COUNT 0x80

typedef struct struct_80192FB0 {
    /* 0x0000 */ s32 unk_0000;
    /* 0x0004 */ u32 unk_0004;
    /* 0x0008 */ struct_imageLoad_arg0 *unk_0008[2];
    /* 0x0010 */ s32 unk_0010;
    /* 0x0014 */ s32 unk_0014;
    /* 0x0018 */ s32 unk_0018;
    /* 0x001C */ s32 unk_001C;
    /* 0x0020 */ s32 unk_0020;
    /* 0x0024 */ s32 unk_0024;
    /* 0x0028 */ struct_80192FB0_unk_0028 unk_0028[STRUCT_80192FB0_UNK_0028_COUNT];
    /* 0x1428 */ s32 unk_1428; // accessed indirectly
} struct_80192FB0; // size = 0x142C

extern RomOffset D_800B6950_usa[];
extern struct_80192FB0 *B_80192FB0_usa;
extern s32 D_800B6990_usa[];

#if VERSION_USA || VERSION_EUR
#define UNKNOWN_VALUE 0x1F4
#elif VERSION_FRA || VERSION_GER
#define UNKNOWN_VALUE 0xBB8
#endif

void func_80044280_usa(s32 arg0, struct_80192FB0_unk_0028 *arg1) {
    s32 var_s2;
    struct_80192FB0_unk_0028 *var_s0;

    if (arg0 % 8 == 0) {
        if (osGetCount() & 1) {
            if (osGetCount() & 4) {
                if (arg1->unk_00 < 8) {
                    arg1->unk_00++;
                }
            } else {
                if (arg1->unk_00 > -8) {
                    arg1->unk_00--;
                }
            }
        }
    }

    for (var_s2 = 0; var_s2 < STRUCT_80192FB0_UNK_0028_COUNT; var_s2++) {
        var_s0 = &arg1[var_s2];

        if (var_s0->unk_14 != 0) {
            var_s0->unk_14--;
        } else {
