/**
 * Original filename: bonus.c
 */

#include "bonus.h"

#include "include_asm.h"
#include "macros_defines.h"
#include "main_variables.h"

#include "animation.h"
#include "bg_screen_load.h"
#include "buffers.h"
#include "end.h"
#include "hvqm2util.h"
#include "image.h"
#include "info.h"
#include "init2d.h"
#include "peel.h"
#include "screen.h"
#include "sfxlimit.h"
#include "sound.h"
#include "tetris.h"
#include "text.h"
#include "the_game.h"
#include "update.h"

#include "001F10.h"

typedef struct struct_800C4490_usa {
    /* 0x0 */ UNK_TYPE4 unk_0;
    /* 0x4 */ UNK_TYPE4 unk_4;
    /* 0x8 */ UNK_TYPE4 unk_8;
    /* 0xC */ UNK_TYPE4 unk_C;
} struct_800C4490_usa; // size = 0x10

typedef struct struct_800C44F0_usa {
    /* 0x0 */ u8 unk_0;
    /* 0x1 */ u8 unk_1;
} struct_800C44F0_usa; // size = 0x2

typedef struct struct_800C4518_usa {
    /* 0x0 */ UNK_TYPE4 unk_0;
    /* 0x4 */ UNK_TYPE4 unk_4;
} struct_800C4518_usa; // size = 0x8

typedef struct struct_800C4598_usa {
    /* 0x0 */ UNK_TYPE4 unk_0;
    /* 0x4 */ UNK_TYPE4 unk_4;
} struct_800C4598_usa; // size = 0x8

extern u32 D_1030FE0[];
extern u32 D_104C660[];
extern u32 D_105B710[];
extern u32 D_1070A60[];

typedef struct struct_8004EC4C_usa_arg2 {
    /* 0x0 */ UNK_TYPE4 unk_0;
    /* 0x0 */ UNK_TYPE1 unk_4[0x4];
} struct_8004EC4C_usa_arg2; // size = 0x8

typedef struct struct_8004EC4C_usa_arg3 {
    /* 0x0 */ UNK_TYPE4 unk_0;
    /* 0x0 */ UNK_TYPE1 unk_4[0x4];
} struct_8004EC4C_usa_arg3; // size = 0x8

#if VERSION_USA
//#ifdef NON_EQUIVALENT
#if 0
void InitBonus(void) {
    s32 var_s3 = 0;
    s32 s5 = 1;
    s32 s8 = 2;
    DATA_INLINE_CONST2 struct_800C4490_usa sp10[] = { 0x40, 0x3E, 0x40, 0x45 };
    DATA_INLINE_CONST2 s32 sp20[] = { 0xF8, 0x100 };
    DATA_INLINE_CONST2 struct_800C4490_usa sp28[] = {
        { 0xC0, 0x2F, 0x13, 0x21 }, { 0x40, 0x1D, 0xB6, 0xBA }, { 0x40, 0x1D, 0xB6, 0xBA },
        { 0x40, 0x1D, 0xE1, 0xBA }, { 0x40, 0x1D, 0xE1, 0xBA },
    };
    DATA_INLINE_CONST2 struct_800C44F0_usa sp78[] = {
        { 0x00, 0x07 }, { 0x01, 0x01 }, { 0x02, 0x00 }, { 0x02, 0x02 }, { 0x05, 0x04 },
        { 0x0C, 0x02 }, { 0x02, 0x02 }, { 0x09, 0x06 }, { 0x02, 0x05 }, { 0x00, 0x00 },
        { 0x07, 0x06 }, { 0x04, 0x04 }, { 0x02, 0x03 }, { 0x05, 0x03 }, { 0x05, 0x09 },
    };
    DATA_INLINE_CONST2 u8 sp98[] = {
        0x1D, 0x30, 0x43, 0x56, 0x69, 0x7C,
    };
    DATA_INLINE_CONST2 struct_800C4518_usa spA0[] = {
        { 192, 129 },                             //
        { 192, BGSCREEN_TEX_7E5010_MAIN_HEIGHT }, // ENUM_GAME_UNK_0000_UNK_4424_1
        { 192, BGSCREEN_TEX_7F5BD0_MAIN_HEIGHT }, // ENUM_GAME_UNK_0000_UNK_4424_2
        { 192, BGSCREEN_TEX_8088D0_MAIN_HEIGHT }, // ENUM_GAME_UNK_0000_UNK_4424_3
        { 192, BGSCREEN_TEX_81A450_MAIN_HEIGHT }, // ENUM_GAME_UNK_0000_UNK_4424_4
        { 192, BGSCREEN_TEX_82C890_MAIN_HEIGHT }, // ENUM_GAME_UNK_0000_UNK_4424_5
        { 192, BGSCREEN_TEX_83EB10_MAIN_HEIGHT }, // ENUM_GAME_UNK_0000_UNK_4424_6
        { 192, BGSCREEN_TEX_8520D0_MAIN_HEIGHT }, // ENUM_GAME_UNK_0000_UNK_4424_7
        { 192, BGSCREEN_TEX_865D90_MAIN_HEIGHT }, // ENUM_GAME_UNK_0000_UNK_4424_8
        { 192, BGSCREEN_TEX_87A4D0_MAIN_HEIGHT }, // ENUM_GAME_UNK_0000_UNK_4424_9
        { 192, BGSCREEN_TEX_88DA90_MAIN_HEIGHT }, // ENUM_GAME_UNK_0000_UNK_4424_10
        { 192, BGSCREEN_TEX_8A8050_MAIN_HEIGHT }, // ENUM_GAME_UNK_0000_UNK_4424_11
        { 192, BGSCREEN_TEX_8BB610_MAIN_HEIGHT }, // ENUM_GAME_UNK_0000_UNK_4424_12
        { 192, BGSCREEN_TEX_8CE310_MAIN_HEIGHT }, // ENUM_GAME_UNK_0000_UNK_4424_13
        { 192, BGSCREEN_TEX_8E2A50_MAIN_HEIGHT }, // ENUM_GAME_UNK_0000_UNK_4424_14
        { 192, BGSCREEN_TEX_902250_MAIN_HEIGHT }, // ENUM_GAME_UNK_0000_UNK_4424_15
    };
    DATA_INLINE_CONST2 struct_800C4598_usa sp120[] = {
        { 65, 63 },                              //
        { 63, BGSCREEN_TEX_7E5010_TOP_HEIGHT },  // ENUM_GAME_UNK_0000_UNK_4424_1
        { 66, BGSCREEN_TEX_7F5BD0_TOP_HEIGHT },  // ENUM_GAME_UNK_0000_UNK_4424_2
        { 71, BGSCREEN_TEX_8088D0_TOP_HEIGHT },  // ENUM_GAME_UNK_0000_UNK_4424_3
        { 101, BGSCREEN_TEX_81A450_TOP_HEIGHT }, // ENUM_GAME_UNK_0000_UNK_4424_4
        { 78, BGSCREEN_TEX_82C890_TOP_HEIGHT },  // ENUM_GAME_UNK_0000_UNK_4424_5
        { 126, BGSCREEN_TEX_83EB10_TOP_HEIGHT }, // ENUM_GAME_UNK_0000_UNK_4424_6
        { 79, BGSCREEN_TEX_8520D0_TOP_HEIGHT },  // ENUM_GAME_UNK_0000_UNK_4424_7
        { 93, BGSCREEN_TEX_865D90_TOP_HEIGHT },  // ENUM_GAME_UNK_0000_UNK_4424_8
        { 87, BGSCREEN_TEX_87A4D0_TOP_HEIGHT },  // ENUM_GAME_UNK_0000_UNK_4424_9
        { 172, BGSCREEN_TEX_88DA90_TOP_HEIGHT }, // ENUM_GAME_UNK_0000_UNK_4424_10
        { 85, BGSCREEN_TEX_8A8050_TOP_HEIGHT },  // ENUM_GAME_UNK_0000_UNK_4424_11
        { 80, BGSCREEN_TEX_8BB610_TOP_HEIGHT },  // ENUM_GAME_UNK_0000_UNK_4424_12
        { 113, BGSCREEN_TEX_8CE310_TOP_HEIGHT }, // ENUM_GAME_UNK_0000_UNK_4424_13
        { 192, BGSCREEN_TEX_8E2A50_TOP_HEIGHT }, // ENUM_GAME_UNK_0000_UNK_4424_14
        { 95, BGSCREEN_TEX_902250_TOP_HEIGHT },  // ENUM_GAME_UNK_0000_UNK_4424_15
    };
    s32 var_s2;
    uObjTxtr *var_v1;
    void *temp_v0;
    uObjBg *var_s0;
    void *temp_s4;
    volatile unsigned short pad;
    s32 t1 = 5;

    gCounter = 0;
    Pon_Image_Heap = &gBufferHeap[SEGMENT_ROM_SIZE(segment_0CA4A0)];

    temp_s4 = Pon_Image_Heap;

    osInvalDCache((void *)D_1030FE0, (u32)D_105B710 - (u32)D_1030FE0);
    func_80001310_usa(SEGMENT_ROM_START(segment_101A80), temp_s4, SEGMENT_ROM_SIZE(segment_101A80));
    Pon_Image_Heap += SEGMENT_ROM_SIZE(segment_101A80);

    if ((gSelection == 0x96) && (gTheGame.cursorBlock[0].unk_00 != 7) && (gTheGame.cursorBlock[1].unk_00 != 8) &&
        (B_801C6C90_usa == 0x10)) {
        PlayMIDI(BGM_INIT_TABLE, 0x20, 0, 1);
    }
    gTheGame.unk_9A50.b.imagePtr = temp_s4 + var_s3;
    // temp_s4 = gTheGame.unk_9A50.b.imagePtr;

    guS2DInitBg(&gTheGame.unk_9A50);

    var_s3 = 0x24400;

    for (var_s2 = 0; var_s2 < s5; var_s2++) {
        var_s0 = &gTheGame.unk_8C88[var_s2];

        var_s0->b.imageX = 0;
        var_s0->b.imageW = sp10[var_s2].unk_0 << 2;
        var_s0->b.frameX = sp10[var_s2].unk_8 << 2;
        var_s0->b.frameW = sp10[var_s2].unk_0 << 2;

        var_s0->b.imageY = 0;
        var_s0->b.imageH = sp10[var_s2].unk_4 << 2;
        var_s0->b.frameY = sp10[var_s2].unk_C << 2;
        var_s0->b.frameH = sp10[var_s2].unk_4 << 2;

        var_s0->b.imagePtr = &temp_s4[var_s3];
        var_s0->b.imageLoad = G_BGLT_LOADTILE;
        var_s0->b.imageFmt = G_IM_FMT_RGBA;
        var_s0->b.imageSiz = G_IM_SIZ_16b;
        var_s0->b.imagePal = 0;
        var_s0->b.imageFlip = 0;

        guS2DInitBg(var_s0);

        var_s3 += sp10[var_s2].unk_0 * sp10[var_s2].unk_4 * 2;
    }

    var_s3 = 0x26300;
    var_s2 = 0;
    while (var_s2 < s8) {
        var_v1 = &gTheGame.unk_8B98[var_s2];
        var_v1->tlut.type = 0x30;
        var_v1->tlut.image = &temp_s4[var_s3];
        var_v1->tlut.phead = 0x100;
        var_v1->tlut.pnum = (sp20[var_s2] - 1);
        var_v1->tlut.zero = 0;
        var_v1->tlut.sid = 0;
        var_v1->tlut.flag = -1;
        var_v1->tlut.mask = 0;
        var_s3 += sp20[var_s2] * 2;
        var_s2 += 1;
    }

    if (t1) {
        for (var_s2 = 0; var_s2 < 5; var_s2++, s5++) {
            var_s0 = &gTheGame.unk_8C88[s5];

            var_s0->b.imageX = 0 << 2;
            var_s0->b.imageW = sp28[var_s2].unk_0 << 2;
            var_s0->b.frameX = sp28[var_s2].unk_8 << 2;
            var_s0->b.frameW = sp28[var_s2].unk_0 << 2;
            var_s0->b.imageY = 0 << 2;
            var_s0->b.imageH = sp28[var_s2].unk_4 << 2;
            var_s0->b.frameY = sp28[var_s2].unk_C << 2;
            var_s0->b.frameH = sp28[var_s2].unk_4 << 2;
            var_s0->b.imagePtr = &temp_s4[var_s3];
            var_s0->b.imageLoad = G_BGLT_LOADTILE;
            var_s0->b.imageFmt = G_IM_FMT_CI;
            var_s0->b.imageSiz = G_IM_SIZ_8b;
            var_s0->b.imagePal = 0;
            var_s0->b.imageFlip = 0;

            guS2DInitBg(var_s0);
            var_s3 += sp28[var_s2].unk_0 * sp28[var_s2].unk_4;
        }
    }

    if (gSelection == 0x96) {
        var_s3 = gTheGame.tetrisWell[1].unk_4424;
        switch (var_s3) {
            case ENUM_GAME_UNK_0000_UNK_4424_1:
                func_80073C20_usa(false, 0, spA0[var_s3].unk_4, sp120[var_s3].unk_4);
                break;

            case ENUM_GAME_UNK_0000_UNK_4424_2:
                func_80073D10_usa(false, 0, spA0[var_s3].unk_4, sp120[var_s3].unk_4);
                break;
            case ENUM_GAME_UNK_0000_UNK_4424_3:
                func_80073E00_usa(false, 0, spA0[var_s3].unk_4, sp120[var_s3].unk_4);
                break;
            case ENUM_GAME_UNK_0000_UNK_4424_4:
                func_80073EF0_usa(false, 0, spA0[var_s3].unk_4, sp120[var_s3].unk_4);
                break;
            case ENUM_GAME_UNK_0000_UNK_4424_5:
                func_80073FE0_usa(false, 0, spA0[var_s3].unk_4, sp120[var_s3].unk_4);
                break;
            case ENUM_GAME_UNK_0000_UNK_4424_6:
                func_800740D0_usa(false, 0, spA0[var_s3].unk_4, sp120[var_s3].unk_4);
                break;
            case ENUM_GAME_UNK_0000_UNK_4424_7:
                func_800741C0_usa(false, 0, spA0[var_s3].unk_4, sp120[var_s3].unk_4);
                break;
            case ENUM_GAME_UNK_0000_UNK_4424_8:
                func_800742B0_usa(false, 0, spA0[var_s3].unk_4, sp120[var_s3].unk_4);
                break;
            case ENUM_GAME_UNK_0000_UNK_4424_9:
                func_800743A0_usa(false, 0, spA0[var_s3].unk_4, sp120[var_s3].unk_4);
                break;
            case ENUM_GAME_UNK_0000_UNK_4424_10:
                func_80074490_usa(false, 0, spA0[var_s3].unk_4, sp120[var_s3].unk_4);
                break;
            case ENUM_GAME_UNK_0000_UNK_4424_11:
                func_80074580_usa(false, 0, spA0[var_s3].unk_4, sp120[var_s3].unk_4);
                break;
            case ENUM_GAME_UNK_0000_UNK_4424_12:
                func_80074670_usa(false, 0, spA0[var_s3].unk_4, sp120[var_s3].unk_4);
                break;
            case ENUM_GAME_UNK_0000_UNK_4424_13:
                func_80074760_usa(false, 0, spA0[var_s3].unk_4, sp120[var_s3].unk_4);
                break;
            case ENUM_GAME_UNK_0000_UNK_4424_14:
                func_80074850_usa(false, 0, spA0[var_s3].unk_4, sp120[var_s3].unk_4);
                break;
            case ENUM_GAME_UNK_0000_UNK_4424_15:
            case ENUM_GAME_UNK_0000_UNK_4424_18:
                func_80074940_usa(false, 0, spA0[var_s3].unk_4, sp120[var_s3].unk_4);
                break;

            case ENUM_GAME_UNK_0000_UNK_4424_16:
                temp_s4 = Pon_Image_Heap;

                osInvalDCache((void *)D_104C660, (u32)D_1070A60 - (u32)D_104C660);
                func_80001310_usa(SEGMENT_ROM_START(segment_background_50F3F0), temp_s4,
                                  SEGMENT_ROM_SIZE(segment_background_50F3F0));
                Pon_Image_Heap = (uintptr_t)Pon_Image_Heap + SEGMENT_ROM_SIZE(segment_background_50F3F0);

                bcopy(&gTheGame.unk_9A50, &gTheGame.unk_8C88[6], sizeof(uObjBg));
                gTheGame.unk_8C88[6].b.imagePtr = temp_s4;
                guS2DInitBg(&gTheGame.unk_8C88[6]);
                break;

            default:
                break;
        }

        if (var_s3 == ENUM_GAME_UNK_0000_UNK_4424_16) {
            gTheGame.unk_8C88[6].b.frameX = -0x2C;
            gTheGame.unk_8C88[6].b.frameY = 0x44;
        } else {
            gTheGame.unk_8C88[6].b.frameX = (0xB2 - sp78[var_s3 - 1].unk_0) << 2;
            gTheGame.unk_8C88[6].b.frameY = (sp120[var_s3].unk_4 + 0x2B - sp78[var_s3 - 1].unk_1) << 2;

            for (var_s2 = 7; var_s2 < ARRAY_COUNT(gTheGame.unk_8C88); var_s2++) {
                gTheGame.unk_8C88[var_s2].b.frameX = (0xB2 - sp78[var_s3 - 1].unk_0) << 2;
                gTheGame.unk_8C88[var_s2].b.frameY = (0x2B - sp78[var_s3 - 1].unk_1) << 2;
            }
        }

        for (var_s2 = 0; var_s2 < 6; var_s2++) {
            InitTetrisState(&gTheGame.tetrisWell[0].block[0][var_s2]);
            gTheGame.tetrisWell[0].unk_3830[0][var_s2].s.objX = sp98[var_s2] << 2;
            gTheGame.tetrisWell[0].unk_3830[0][var_s2].s.objY = -(20 << 2);
            gTheGame.tetrisWell[0].block[0][var_s2].delay = sp98[var_s2];
        }
    }

    gTheGame.tetrisWell[0].unk_43EC = 0;
    gTheGame.tetrisWell[0].unk_43FC = 0;
    gWhatever = 0;
}
#else
INCLUDE_ASM("asm/usa/nonmatchings/main/bonus", InitBonus);
#endif
#endif

#if VERSION_EUR
INCLUDE_RODATA("asm/eur/nonmatchings/main/bonus", RO_800C47E0_eur);
#endif

#if VERSION_EUR
INCLUDE_RODATA("asm/eur/nonmatchings/main/bonus", RO_800C47F0_eur);
#endif

#if VERSION_EUR
INCLUDE_RODATA("asm/eur/nonmatchings/main/bonus", RO_800C4840_eur);
#endif

#if VERSION_EUR
INCLUDE_RODATA("asm/eur/nonmatchings/main/bonus", RO_800C4860_eur);
#endif

#if VERSION_EUR
INCLUDE_RODATA("asm/eur/nonmatchings/main/bonus", RO_800C4868_eur);
#endif

#if VERSION_EUR
INCLUDE_RODATA("asm/eur/nonmatchings/main/bonus", RO_800C48E8_eur);
#endif

#if VERSION_EUR
INCLUDE_ASM("asm/eur/nonmatchings/main/bonus", InitBonus);
#endif

#if VERSION_FRA
INCLUDE_RODATA("asm/fra/nonmatchings/main/bonus", RO_800C2E90_fra);
#endif

#if VERSION_FRA
INCLUDE_RODATA("asm/fra/nonmatchings/main/bonus", RO_800C2EA0_fra);
#endif

#if VERSION_FRA
INCLUDE_RODATA("asm/fra/nonmatchings/main/bonus", RO_800C2EF0_fra);
#endif

#if VERSION_FRA
INCLUDE_RODATA("asm/fra/nonmatchings/main/bonus", RO_800C2F10_fra);
#endif

#if VERSION_FRA
INCLUDE_RODATA("asm/fra/nonmatchings/main/bonus", RO_800C2F18_fra);
#endif

#if VERSION_FRA
INCLUDE_RODATA("asm/fra/nonmatchings/main/bonus", RO_800C2F98_fra);
#endif

#if VERSION_FRA
INCLUDE_ASM("asm/fra/nonmatchings/main/bonus", InitBonus);
#endif

#if VERSION_GER
INCLUDE_RODATA("asm/ger/nonmatchings/main/bonus", RO_800B9E50_ger);
#endif

#if VERSION_GER
INCLUDE_RODATA("asm/ger/nonmatchings/main/bonus", RO_800B9E60_ger);
#endif

#if VERSION_GER
INCLUDE_RODATA("asm/ger/nonmatchings/main/bonus", RO_800B9EB0_ger);
#endif

#if VERSION_GER
INCLUDE_RODATA("asm/ger/nonmatchings/main/bonus", RO_800B9ED0_ger);
#endif

#if VERSION_GER
INCLUDE_RODATA("asm/ger/nonmatchings/main/bonus", RO_800B9ED8_ger);
#endif

#if VERSION_GER
INCLUDE_RODATA("asm/ger/nonmatchings/main/bonus", RO_800B9F58_ger);
#endif

#if VERSION_GER
INCLUDE_ASM("asm/ger/nonmatchings/main/bonus", InitBonus);
#endif

typedef struct struct_800C4660_usa {
    /* 0x0 */ UNK_TYPE4 unk_0;
    /* 0x4 */ UNK_TYPE4 unk_4;
} struct_800C4660_usa; // size = 0x8

typedef struct struct_800C48A8_usa {
    /* 0x0 */ u16 unk_0;
    /* 0x2 */ u16 unk_2;
} struct_800C48A8_usa; // size = 0x4

void DoBonus(void) {
    s32 var_s5 = 0;
    char sp10[8];
    struct_800C4660_usa sp18[] = {
        { 2, 120 },  { 4, 118 },  { 6, 117 },  { 8, 115 },  { 10, 114 }, { 12, 113 }, { 14, 112 }, { 16, 111 },
        { 18, 110 }, { 20, 110 }, { 22, 109 }, { 24, 109 }, { 26, 108 }, { 28, 108 }, { 30, 108 }, { 30, 108 },
        { 32, 109 }, { 34, 110 }, { 36, 111 }, { 38, 112 }, { 40, 114 }, { 42, 116 }, { 44, 118 }, { 46, 120 },
        { 48, 122 }, { 50, 124 }, { 52, 127 }, { 54, 130 }, { 56, 133 }, { 58, 136 }, { 60, 140 }, { 62, 144 },
        { 64, 149 }, { 66, 154 }, { 68, 159 }, { 70, 164 }, { 71, 169 }, { 73, 174 }, { 75, 180 }, { 76, 186 },
        { 77, 192 }, { 78, 198 }, { 79, 204 }, { 80, 210 }, { 81, 216 }, { 82, 222 }, { 83, 228 }, { 83, 234 },
        { 84, 240 }, { 85, 246 }, { 86, 252 }, { 87, 258 }, { 88, 264 }, { 88, 270 }, { 89, 276 }, { 90, 282 },
        { 91, 286 },
    };
    s32 sp1E0[] = {
