#include "hvqm2util.h"

#include "ultra64.h"
#include "libmus/libmus.h"
#include "libmus/aud_thread.h"
#include "HVQM2File.h"

#include "include_asm.h"
#include "macros_defines.h"
#include "unknown_structs.h"
#include "main_functions.h"
#include "main_variables.h"

#include "buffers.h"
#include "cfb_keep.h"
#include "timekeeper.h"
#include "file.h"
#include "tetsound.h"
#include "image.h"
#include "sound.h"
#include "peel.h"
#include "boot_main.h"
#include "pon_thread.h"

#define VIDEO_MSG 666
#define RSP_DONE_MSG 667

typedef struct TimeKeeperCommand {
    /* 0x0 */ tkRewindProc rewind; /* Pointer to stream rewind function */
    /* 0x4 */ u32 samples_per_sec; /* Audio sampling rate */
} TimeKeeperCommand;               // size = 0x8

typedef struct TimeKeeperVideoRing {
    /* 0x00 */ u64 disptime; /* Display time */
    /* 0x08 */ void *vaddr;  /* Frame buffer address */
    /* 0x0C */ u32 *statP;   /* Pointer to frame buffer state flag */
} TimeKeeperVideoRing;       // size = 0x10

typedef struct TimeKeeperAudioRing {
    /* 0x0 */ void *buf; /* PCM data buffer */
    /* 0x4 */ u32 len;   /* PCM data length */
} TimeKeeperAudioRing;   // size = 0x8

#define TIMEKEEPER_VIDEO_RING_SIZE 2
#define TIMEKEEPER_AUDIO_RING_SIZE 3

typedef struct struct_8018EA50_usa {
    /* 0x00000 */ u64 pad1[2];
    /* 0x00010 */ s16 pcmbuf[NUM_PCMBUFs][PCMBUF_SIZE];
    /* 0x11908 */ u64 pad2[1];
    /* 0x11910 */ u8 hvqbuf[HVQ_DATASIZE_MAX];
    /* 0x18E40 */ u64 pad3[2];
    /* 0x18E50 */ u8 adpcmbuf[AUDIO_RECORD_SIZE_MAX];
    /* 0x19A08 */ u64 pad4[1];
    /* 0x19A10 */ u16 hvqwork[(SCREEN_WIDTH / 8) * (SCREEN_HEIGHT / 4) * 4];
    /* 0x1E510 */ u64 pad5[2];
    /* 0x1E520 */ HVQM2Info hvq_spfifo[HVQ_SPFIFO_SIZE];
    /* 0x45620 */ u64 pad6[2];
    /* 0x45630 */ STACK(hvq_yieldbuf, 0xC10);
    /* 0x46240 */ u8 hvqm_headerBuf[sizeof(HVQM2Header) + 0x10];
} struct_8018EA50_usa; // size = 0x46290

static struct_8018EA50_usa *B_8018EA50_usa;

static u32 B_8018EA54_usa;

static u32 gHVQM2UtilCurrentVideoRomAddress;

/**
 * Original name: audioDmaMesgBlock
 */
static OSIoMesg audioDmaMesgBlock;

/**
 * Original name: audioDmaMessageQ
 */
static OSMesgQueue audioDmaMessageQ;

/**
 * Original name: audioDmaMessages
 */
static OSMesg audioDmaMessages[1];

/**
 * Original name: videoDmaMesgBlock
 */
static OSIoMesg videoDmaMesgBlock;

/**
 * Original name: videoDmaMessageQ
 */
static OSMesgQueue videoDmaMessageQ;

/**
 * Original name: videoDmaMessages
 */
static OSMesg videoDmaMessages[1];

/**
 * Original name: spMesgQ
 */
static OSMesgQueue spMesgQ;

/**
 * Original name: spMesgBuf
 */
static OSMesg spMesgBuf[1];

/**
 * Original name: total_frames
 */
static u32 total_frames;

/**
 * Original name: total_audio_records
 */
static u32 total_audio_records;

/**
 * Original name: video_streamP
 */
static u32 video_streamP;

/**
 * Original name: audio_streamP
 */
static u32 audio_streamP;

#if REGION_PAL
static u32 B_8018DBFC_eur;
#endif

/**
 * Original name: audio_remain
 */
static u32 audio_remain;

/**
 * Original name: video_remain
 */
static u32 video_remain;

/**
 * Original name: disptime
 */
static u64 disptime;

/**
 * Original name: adpcm_state
 */
static ADPCMstate adpcm_state;

/**
 * Original name: tkThread
 */
static OSThread tkThread;

/**
 * Original name: tkStack
 */
static STACK(tkStack, 0x2000);

/**
 * Original name: daCounterThread
 */
static OSThread daCounterThread;

/**
 * Original name: daCounterStack
 */
static STACK(daCounterStack, 0x2000);

/**
 * Original name: tkCmdMesgQ
 */
static OSMesgQueue tkCmdMesgQ;

/**
 * Original name: tkCmdMesgBuf
 */
static OSMesg tkCmdMesgBuf[1];

/**
 * Original name: tkResMesgQ
 */
static OSMesgQueue tkResMesgQ;

/**
 * Original name: tkResMesgBuf
 */
static OSMesg tkResMesgBuf[1];

/**
 * Original name: viMessageQ
 */
static OSMesgQueue viMessageQ;

/**
 * Original name: viMessages
 */
static OSMesg viMessages[2];

/**
 * Original name: aiMessageQ
 */
static OSMesgQueue aiMessageQ;

/**
 * Original name: aiMessages
 */
static OSMesg aiMessages[2];

/**
 * Original name: videoRing
 */
static TimeKeeperVideoRing videoRing[TIMEKEEPER_VIDEO_RING_SIZE];

/**
 * Original name: videoRingCount
 */
static s32 videoRingCount;

/**
 * Original name: videoRingWrite
 */
static s32 videoRingWrite;

/**
 * Original name: videoRingRead
 */
static s32 videoRingRead;

/**
 * Original name: audioRing
 */
static TimeKeeperAudioRing audioRing[TIMEKEEPER_AUDIO_RING_SIZE];

/**
 * Original name: audioRingCount
 */
static s32 audioRingCount;

/**
 * Original name: audioRingWrite
 */
static s32 audioRingWrite;

/**
 * Original name: audioRingRead
 */
static s32 audioRingRead;

/**
 * Original name: pcmBufferCount
 */
static s32 pcmBufferCount;

/**
 * Original name: aiFIFOsamples
 */
static u32 aiFIFOsamples;

/**
 * Original name: aiDAsamples
 */
static u32 aiDAsamples;

/**
 * Original name: pcmModBuf
 */
static s16 pcmModBuf[(PCM_ALIGN - 1) * PCM_CHANNELS];

/**
 * Original name: clock_alive
 */
static bool clock_alive;

/**
 * Original name: samples_per_sec
 */
static u32 samples_per_sec;

/**
 * Original name: samples_played
 */
static u64 samples_played;

/**
 * Original name: last_time
 */
static u64 last_time;

/**
 * Macro for loading multi-byte data from buffer holding data from stream
 */
#define load32(from) (*(u32 *)(from))
#define load16(from) (*(u16 *)(from))

INLINE void RomCopy(void *dest, RomOffset src, size_t len, s32 pri, OSIoMesg *mb, OSMesgQueue *mq) {
    osInvalDCache(dest, len);

    while (osPiStartDma(mb, pri, 0, src, dest, len, mq) == -1) {}

    osRecvMesg(mq, NULL, OS_MESG_BLOCK);
}

#if REGION_PAL
typedef struct struct_8003E60C_eur_s0 {
    /* 0x0 */ CARD8 audio_format;
    /* 0x1 */ CARD8 channels;
    /* 0x2 */ CARD8 sample_bits;
    /* 0x3 */ CARD8 audio_quantize_step;
    /* 0x4 */ CARD32 total_audio_records;
    /* 0x8 */ CARD32 samples_per_sec;
    /* 0xC */ CARD32 max_audio_record_size;
} struct_8003E60C_eur_s0; // size = 0x10

INLINE void func_8003E60C_eur(File *arg0, HVQM2Header *header) {
    u8 sp20[sizeof(struct_8003E60C_eur_s0) + 0x10];
    RomOffset sp40;
    struct_8003E60C_eur_s0 *temp_s0;

    if (!fileGetAddress(arg0, &sp40)) {
        B_8018DBFC_eur = gHVQM2UtilCurrentVideoRomAddress + sizeof(HVQM2Header);
        return;
    }

    temp_s0 = OS_DCACHE_ROUNDUP_ADDR(sp20);
    B_8018DBFC_eur = sp40 + sizeof(struct_8003E60C_eur_s0);
    RomCopy(temp_s0, sp40, sizeof(struct_8003E60C_eur_s0), OS_MESG_PRI_NORMAL, &videoDmaMesgBlock, &videoDmaMessageQ);

    header->audio_format = temp_s0->audio_format;
    header->channels = temp_s0->channels;
    header->sample_bits = temp_s0->sample_bits;
    header->audio_quantize_step = temp_s0->audio_quantize_step;
    header->total_audio_records = temp_s0->total_audio_records;
    header->max_audio_record_size = temp_s0->max_audio_record_size;
}
#endif

/**
