/**
 * Original filename: menu.c
 */

#include "menu.h"

#include "include_asm.h"
#include "macros_defines.h"
#include "main_variables.h"

#include "buffers.h"
#include "image.h"
#include "info.h"
#include "peel.h"
#include "screen.h"
#include "segment_symbols.h"
#include "sfxlimit.h"
#include "sound.h"
#include "tetsound.h"
#include "the_game.h"

typedef enum enum_TypeMenu {
    MT_NONE = 0,
    MT_MANY = 1,
    MT_PLAY = 2,
    MT_MAIN = 3,
    MT_1P = 4,
    MT_1P_ENDLESS_NAME = 5,
    MT_1P_ENDLESS_LEVEL = 6,
    MT_1P_ENDLESS_CHARACTER = 7,
    MT_1P_VS_NAME = 8,
    MT_1P_VS_LEVEL = 9,
    MT_1P_ATTACK_NAME = 10,
    MT_1P_ATTACK_LEVEL = 11,
    MT_1P_ATTACK_CHARACTER = 12,
    MT_1P_CLEAR_NAME = 13,
    MT_1P_CLEAR_2D3D = 14,
    MT_1P_CLEAR_XTRA = 15,
    MT_1P_CLEAR_XTRATALK = 16,
    MT_1P_CLEAR_LEVEL = 17,
    MT_1P_PUZZLE_NAME = 18,
    MT_1P_PUZZLE_LEVEL = 19,
    MT_1P_PUZZLE_STAGE1 = 20,
    MT_1P_PUZZLE_STAGE2 = 21,
    MT_1P_PUZZLE_STAGE3 = 22,
    MT_1P_PUZZLE_STAGE3D = 23,
    MT_1P_PUZZLE_STAGE4 = 24,
    MT_1P_PUZZLE_STAGE5 = 25,
    MT_1P_PUZZLE_CUSTOM = 26,
    MT_2P = 27,
    MT_2P_VS_NAME = 28,
    MT_2P_VS_LEVEL = 29,
    MT_2P_VS_CHARACTER = 30,
    MT_2P_ATTACK_NAME = 31,
    MT_2P_ATTACK_LEVEL = 32,
    MT_2P_ATTACK_CHARACTER = 33,
    MT_2P_CLEAR_NAME = 34,
    MT_2P_CLEAR_LEVEL = 35,
    MT_2P_CLEAR_CHARACTER = 36,
    MT_4P = 37,
    MT_4P_LEVEL = 38,
    MT_4P_CHARACTER = 39,
    MT_HOWTO = 40,
    MT_HOWTO_CONTROLLER = 41,
    MT_PRACTICE = 42,
    MT_PRACTICE_PAGEDEMO = 43,
    MT_PRACTICE_PAGEMIMIC = 44,
    MT_PRACTICE_SUPEREASY = 45,
    MT_NAME = 46,
    MT_NAME_ENTRY = 47,
    MT_NAME_DELETE = 48,
    MT_OPTIONS = 49,
    MT_OPTIONS_RECORDNAME = 50,
    MT_OPTIONS_RECORDSHOW = 51,
    MT_OPTIONS_EDITOR = 52,
    MT_OPTIONS_EDITORNAME = 53,
    MT_OPTIONS_EDITOR_HOW = 54,
    MT_OPTIONS_CHARACTER = 55,
    MT_OPTIONS_CHARACTERSHOW = 56,
    MT_OPTIONS_SETTINGS = 57,
    MT_OPTIONS_SOUND = 58,
    MT_OPTIONS_SCREEN = 59,
    MT_MULTI_PLAY = 60,
    MT_HOW_MULTI_PLAYER_ATTACK = 61,
    MT_HOW_MULTI_PLAYER_SCORE = 62,
    MT_HOW_MULTI_PLAYER_CLEAR = 63,
    MT_ATTACK_BATTLE = 64,
    MT_SCORE_ATTACK = 65,
    MT_STAGE_CLEAR = 66,
} enum_TypeMenu;

typedef struct struct_800B5DF8_usa {
    /* 0x00 */ UNK_PAD unk_00[0x8];
    /* 0x08 */ screenDraw_callback *unk_08;
    /* 0x0C */ UNK_PAD unk_0C[0x4];
    /* 0x10 */ enum_TypeMenu unk_10;
    /* 0x14 */ UNK_PAD unk_14[0x4];
} struct_800B5DF8_usa; // size = 0x18

#if 0
typedef struct /* struct_menu_c_1974 */ {
    // total size: 0x18
    char * szName; // offset 0x0, size 0x4
    void (* pfInit)(int, @enum$105menu_c); // offset 0x4, size 0x4
    void (* pfDraw)(union {
        struct {
            // total size: 0x8
            unsigned int w0; // offset 0x0, size 0x4
            unsigned int w1; // offset 0x4, size 0x4
        } words; // offset 0x0, size 0x8
        struct {
            // total size: 0x8
            int cmd : 8; // offset 0x0, size 0x4
            unsigned int par : 8; // offset 0x0, size 0x4
            unsigned int len : 16; // offset 0x0, size 0x4
            unsigned int addr; // offset 0x4, size 0x4
        } dma; // offset 0x0, size 0x8
        struct {
            // total size: 0x8
            int cmd : 8; // offset 0x0, size 0x4
            int pad : 24; // offset 0x0, size 0x4
            struct {
                // total size: 0x4
                unsigned char flag; // offset 0x0, size 0x1
                unsigned char v[3]; // offset 0x1, size 0x3
            } tri; // offset 0x4, size 0x4
        } tri; // offset 0x0, size 0x8
        struct {
            // total size: 0x8
            int cmd : 8; // offset 0x0, size 0x4
            int pad : 24; // offset 0x0, size 0x4
            struct {
                // total size: 0x4
                unsigned char flag; // offset 0x0, size 0x1
                unsigned char v[3]; // offset 0x1, size 0x3
            } line; // offset 0x4, size 0x4
        } line; // offset 0x0, size 0x8
        struct {
            // total size: 0x8
            int cmd : 8; // offset 0x0, size 0x4
            int pad1 : 24; // offset 0x0, size 0x4
            int pad2 : 24; // offset 0x4, size 0x4
            unsigned int param : 8; // offset 0x4, size 0x4
        } popmtx; // offset 0x0, size 0x8
        struct {
            // total size: 0x8
            int cmd : 8; // offset 0x0, size 0x4
            int pad0 : 8; // offset 0x0, size 0x4
            int mw_index : 8; // offset 0x0, size 0x4
            int number : 8; // offset 0x0, size 0x4
            int pad1 : 8; // offset 0x4, size 0x4
            int base : 24; // offset 0x4, size 0x4
        } segment; // offset 0x0, size 0x8
        struct {
            // total size: 0x8
            int cmd : 8; // offset 0x0, size 0x4
            int pad0 : 8; // offset 0x0, size 0x4
            int sft : 8; // offset 0x0, size 0x4
            int len : 8; // offset 0x0, size 0x4
            unsigned int data : 32; // offset 0x4, size 0x4
        } setothermodeH; // offset 0x0, size 0x8
        struct {
            // total size: 0x8
            int cmd : 8; // offset 0x0, size 0x4
            int pad0 : 8; // offset 0x0, size 0x4
            int sft : 8; // offset 0x0, size 0x4
            int len : 8; // offset 0x0, size 0x4
            unsigned int data : 32; // offset 0x4, size 0x4
        } setothermodeL; // offset 0x0, size 0x8
        struct {
            // total size: 0x8
            unsigned char cmd; // offset 0x0, size 0x1
            unsigned char lodscale; // offset 0x1, size 0x1
            unsigned char tile; // offset 0x2, size 0x1
            unsigned char on; // offset 0x3, size 0x1
            unsigned short s; // offset 0x4, size 0x2
            unsigned short t; // offset 0x6, size 0x2
        } texture; // offset 0x0, size 0x8
        struct {
            // total size: 0x8
            int cmd : 8; // offset 0x0, size 0x4
            int pad1 : 24; // offset 0x0, size 0x4
            signed short pad2; // offset 0x4, size 0x2
            signed short scale; // offset 0x6, size 0x2
        } perspnorm; // offset 0x0, size 0x8
        struct {
            // total size: 0x8
            int cmd : 8; // offset 0x0, size 0x4
            unsigned int fmt : 3; // offset 0x0, size 0x4
            unsigned int siz : 2; // offset 0x0, size 0x4
            unsigned int pad : 7; // offset 0x0, size 0x4
            unsigned int wd : 12; // offset 0x0, size 0x4
            unsigned int dram; // offset 0x4, size 0x4
        } setimg; // offset 0x0, size 0x8
        struct {
            // total size: 0x8
            int cmd : 8; // offset 0x0, size 0x4
            unsigned int muxs0 : 24; // offset 0x0, size 0x4
            unsigned int muxs1 : 32; // offset 0x4, size 0x4
        } setcombine; // offset 0x0, size 0x8
        struct {
            // total size: 0x8
            int cmd : 8; // offset 0x0, size 0x4
            unsigned char pad; // offset 0x1, size 0x1
            unsigned char prim_min_level; // offset 0x2, size 0x1
            unsigned char prim_level; // offset 0x3, size 0x1
            unsigned long color; // offset 0x4, size 0x4
        } setcolor; // offset 0x0, size 0x8
        struct {
            // total size: 0x8
            int cmd : 8; // offset 0x0, size 0x4
            int x0 : 10; // offset 0x0, size 0x4
            int x0frac : 2; // offset 0x0, size 0x4
            int y0 : 10; // offset 0x0, size 0x4
            int y0frac : 2; // offset 0x0, size 0x4
            unsigned int pad : 8; // offset 0x4, size 0x4
            int x1 : 10; // offset 0x4, size 0x4
            int x1frac : 2; // offset 0x4, size 0x4
            int y1 : 10; // offset 0x4, size 0x4
            int y1frac : 2; // offset 0x4, size 0x4
        } fillrect; // offset 0x0, size 0x8
        struct {
            // total size: 0x8
            int cmd : 8; // offset 0x0, size 0x4
            unsigned int fmt : 3; // offset 0x0, size 0x4
            unsigned int siz : 2; // offset 0x0, size 0x4
            unsigned int pad0 : 1; // offset 0x0, size 0x4
            unsigned int line : 9; // offset 0x0, size 0x4
            unsigned int tmem : 9; // offset 0x0, size 0x4
            unsigned int pad1 : 5; // offset 0x4, size 0x4
            unsigned int tile : 3; // offset 0x4, size 0x4
            unsigned int palette : 4; // offset 0x4, size 0x4
            unsigned int ct : 1; // offset 0x4, size 0x4
            unsigned int mt : 1; // offset 0x4, size 0x4
            unsigned int maskt : 4; // offset 0x4, size 0x4
            unsigned int shiftt : 4; // offset 0x4, size 0x4
            unsigned int cs : 1; // offset 0x4, size 0x4
            unsigned int ms : 1; // offset 0x4, size 0x4
            unsigned int masks : 4; // offset 0x4, size 0x4
            unsigned int shifts : 4; // offset 0x4, size 0x4
        } settile; // offset 0x0, size 0x8
        struct {
            // total size: 0x8
            int cmd : 8; // offset 0x0, size 0x4
            unsigned int sl : 12; // offset 0x0, size 0x4
            unsigned int tl : 12; // offset 0x0, size 0x4
            int pad : 5; // offset 0x4, size 0x4
            unsigned int tile : 3; // offset 0x4, size 0x4
            unsigned int sh : 12; // offset 0x4, size 0x4
            unsigned int th : 12; // offset 0x4, size 0x4
        } loadtile; // offset 0x0, size 0x8
        struct {
            // total size: 0x8
            int cmd : 8; // offset 0x0, size 0x4
            unsigned int sl : 12; // offset 0x0, size 0x4
            unsigned int tl : 12; // offset 0x0, size 0x4
            int pad : 5; // offset 0x4, size 0x4
            unsigned int tile : 3; // offset 0x4, size 0x4
            unsigned int sh : 12; // offset 0x4, size 0x4
            unsigned int th : 12; // offset 0x4, size 0x4
        } settilesize; // offset 0x0, size 0x8
        struct {
            // total size: 0x8
            int cmd : 8; // offset 0x0, size 0x4
            unsigned int sl : 12; // offset 0x0, size 0x4
            unsigned int tl : 12; // offset 0x0, size 0x4
            int pad : 5; // offset 0x4, size 0x4
            unsigned int tile : 3; // offset 0x4, size 0x4
            unsigned int sh : 12; // offset 0x4, size 0x4
            unsigned int th : 12; // offset 0x4, size 0x4
        } loadtlut; // offset 0x0, size 0x8
        long long force_structure_alignment; // offset 0x0, size 0x8
    } * *, int, int); // offset 0x8, size 0x4
    void (* pfTick)(int, int, int *); // offset 0xC, size 0x4
    @enum$105menu_c eType; // offset 0x10, size 0x4
    @enum$105menu_c eTypeNext; // offset 0x14, size 0x4
} struct_menu_c_1974;
#endif

s32 menuSetScreen(enum_TypeMenu eType, s32 bBack);
void func_8000A940_usa(s32 arg0, s32 arg1, s32 arg2);

// menuUpdateSound?
void func_800175F8_usa(void);

// DummyLoad? menuLoadData?
s32 func_80018EF8_usa(void);
void func_800194DC_usa(enum_TypeMenu arg0);

extern s32 D_800B5A14_usa;

extern s32 gnPositionFairyX;
extern s32 gnPositionFairyY;

extern s32 gnSkipFrame;
extern s32 gnCountMenu;

extern enum_TypeMenu geTypeMenu;

extern struct_800B5DF8_usa gaMenuData[0x2D];

// gaeTypeMenu?
extern enum_TypeMenu B_8018A850_usa[];

extern s32 B_8018A81C_usa;
extern s32 B_8018A828_usa;
extern s32 B_8018A834_usa;
extern s32 B_8018A838_usa;
extern s32 B_8018A854_usa;
