/**
 * Original filename: sound.c
 */

#include "sound.h"

#include "ultra64.h"
#include "libmus/libmus.h"
#include "libmus/lib_memory.h"

#include "include_asm.h"
#include "macros_defines.h"
#include "unknown_structs.h"
#include "main_functions.h"
#include "main_variables.h"

#include "rom_offsets.h"
#include "sfxlimit.h"
#include "boot_main.h"
#include "pon_thread.h"

extern s16 D_800B3AE4_usa;

extern s32 D_800B3AEC_usa;

typedef struct struct_8018A748_usa {
    /* 0x00 */ UNK_TYPE4 unk_00;
    /* 0x04 */ musHandle unk_04; // handle
    /* 0x08 */ u8 *unk_08;
    /* 0x0C */ struct song_t *song_addr;
    /* 0x10 */ UNK_TYPE4 unk_10;
    /* 0x14 */ UNK_TYPE4 unk_14;
    /* 0x18 */ UNK_TYPE4 unk_18;
    /* 0x1C */ s16 unk_1C;
    /* 0x1E */ UNK_TYPE1 unk_1E[0x2];
    /* 0x20 */ UNK_TYPE1 unk_20[0x4];
    /* 0x24 */ UNK_TYPE2 unk_24;
    /* 0x26 */ UNK_TYPE2 unk_26;
    /* 0x28 */ f32 unk_28;
    /* 0x2C */ f32 unk_2C;
    /* 0x30 */ f32 unk_30;
    /* 0x34 */ struct_8018A748_usa_callback *callback;
} struct_8018A748_usa; // size = 0x38

typedef struct struct_8018A6F8_usa {
    /* 0x0 */ void *unk_0;
    /* 0x4 */ void *unk_4;
    /* 0x8 */ void *unk_8;
    /* 0xC */ RomOffset unk_C;
} struct_8018A6F8_usa; // size = 0x10

extern s32 B_800CF2A0_usa;

// buffers
extern u8 B_800CF2B0_usa[];
extern u8 B_8016F2B0_usa[];
extern u8 B_801792B0_usa[];
extern u8 B_80182AB0_usa[];
extern u8 B_801842B0_usa[];
extern u8 B_801876B0_usa[];
extern u8 B_80188EB0_usa[];

extern struct song_t *B_8018A6B0_usa;
extern struct song_t *B_8018A6B4_usa;
extern UNK_PTR B_8018A6B8_usa;
extern UNK_PTR B_8018A6BC_usa;
extern UNK_TYPE **B_8018A6C0_usa;
extern UNK_PTR B_8018A6C4_usa;
extern UNK_PTR B_8018A6C8_usa;
extern UNK_PTR B_8018A6CC_usa;
extern UNK_PTR B_8018A6D0_usa;
extern UNK_PTR B_8018A6D8_usa;
extern UNK_PTR B_8018A6DC_usa;
extern s32 B_8018A6E0_usa;
extern UNK_PTR B_8018A6E4_usa;
extern UNK_PTR B_8018A6E8_usa;
extern s16 B_8018A6EC_usa;
extern s16 B_8018A6EE_usa;
extern s16 B_8018A6F0_usa;

extern struct_8018A6F8_usa B_8018A6F8_usa[5];

extern struct_8018A748_usa B_8018A748_usa[2];
extern s32 B_8018A7B8_usa[2][4];

// non static
